{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "#": 5,
      ".": 6,
      ":": 7,
      "a": 8,
      "e": 9,
      "h": 10,
      "i": 11,
      "k": 12,
      "l": 13,
      "n": 14,
      "o": 15,
      "r": 16,
      "s": 17,
      "t": 18,
      "u": 19,
      "w": 20,
      "y": 21,
      "̀": 22,
      "’": 23,
      "it": 24,
      "ke": 25,
      "ike": 26,
      "like": 27,
      "no": 28,
      "we": 29,
      "̀n": 30,
      "nòn": 31,
      "likes": 32,
      "anòn": 33,
      "enòn": 34,
      "he": 35,
      "io": 36,
      "ienòn": 37,
      "kanòn": 38,
      "ou": 39,
      "ranòn": 40,
      "senòn": 41,
      "she": 42,
      "you": 43,
      "kenòn": 44,
      "ionòn": 45
    },
    "merges": [
      [
        "i",
        "t"
      ],
      [
        "k",
        "e"
      ],
      [
        "i",
        "ke"
      ],
      [
        "l",
        "ike"
      ],
      [
        "n",
        "o"
      ],
      [
        "w",
        "e"
      ],
      [
        "̀",
        "n"
      ],
      [
        "no",
        "̀n"
      ],
      [
        "like",
        "s"
      ],
      [
        "a",
        "nòn"
      ],
      [
        "e",
        "nòn"
      ],
      [
        "h",
        "e"
      ],
      [
        "i",
        "o"
      ],
      [
        "i",
        "enòn"
      ],
      [
        "k",
        "anòn"
      ],
      [
        "o",
        "u"
      ],
      [
        "r",
        "anòn"
      ],
      [
        "s",
        "enòn"
      ],
      [
        "s",
        "he"
      ],
      [
        "y",
        "ou"
      ],
      [
        "ke",
        "nòn"
      ],
      [
        "io",
        "nòn"
      ]
    ]
  }
}